# 2. ყველა ოპერატორის 2-2 მაგალითი:

print(5 == 5)       
print("cat" == "dog")  

print(3 != 4)      
print("a" != "a") 

print(10 > 7)       
print(2 > 5)      

print(3 < 10)     
print(9 < 4)      

print(5 >= 5)    
print(6 >= 7)     

print(4 <= 4)      
print(9 <= 3)      

num1 = "40"
num2 = 40
print(num1 == num2)
# გამოიტანს False-ს
# მიზეზი: num1 არის სტრინგი ("40"), ხოლო num2 არის მთელი რიცხვი (40).
# შედარების დროს == ოპერატორი ამოწმებს არა მხოლოდ მნიშვნელობას, არამედ ტიპსაც.
# განსხვავებული ტიპები ერთმანეთს ტოლი არ არის, ამიტომ პასუხია False.