# ifამოწმებს პირობას და თუ იგი სიმართლეა (True), ასრულებს შესაბამის ბლოკს.	როცა გინდა, რომ რაღაც კონკრეტული პირობა შეამოწმო და იმ შემთხვევაში რაღაც მოხდეს.
# elif	ნიშნავს "else if". ამოწმებს ახალ პირობას, თუ წინა if ან elif ცრუ იყო.	მაშინ ვიყენებთ, როცა გვაქვს რამდენიმე განსხვავებული შემთხვევა, რომლებიც უნდა შევამოწმოთ ერთმანეთის შემდეგ.
# else	გამოიყენება მაშინ, როცა არც ერთი წინა პირობა არ იყო ჭეშმარიტი.	ყველა სხვა შემთხვევისთვის ვიყენებთ, როცა არც ერთი ზემოთ ჩამოთვლილი პირობა არ სრულდება.

# elif გვჭირდება მაშინ, როცა მგრძნობიარე ვართ რამდენიმე სხვადასხვა პირობაზე, მაგრამ მხოლოდ ერთის შესრულება გვინდა. მაგალითად:

# python
# Copy
# Edit
# if x == 10:
#     print("x is 10")
# elif x == 20:
#     print("x is 20")
# else:
#     print("x is something else")
# თუ x იქნება 20, მხოლოდ მეორე ბლოკი შესრულდება. ასე თავიდან ავიცილებთ ყველა შესაძლო ვარიანტის if-ებით დაწერას, რაც ნაკლებად ეფექტურია.